# Arquivo para estudo da materia de ciencia de dados

#importação de bibliotecas

In [18]:
import pandas as pd
import numpy as np
import seaborn as sea
import matplotlib.pyplot as plt
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots
import plotly.figure_factory as ff
import warnings
warnings.filterwarnings("ignore")

# Exibir a versão de cada lib

In [19]:
def verificaVersão(lib, libModule):
    try:
        print(f"A versão da biblioteca {lib} é {libModule.__version__}")

    except AttributeError:
        try:
            print(f"A versão da biblioteca {lib} é {libModule.version}")
        except AttributeError:
            print(f"A biblioteca {lib} não tem modulo de versão")
    except Exception as e:
        print(f"Houve um erro inesperado -> {e}")

verificaVersão("pd",pd)
verificaVersão("np",np)
verificaVersão("sea",sea)
verificaVersão("plt",plt)
verificaVersão("px",px)
verificaVersão("go",go)
verificaVersão("make_subplots",make_subplots)
verificaVersão("ff",ff)

A versão da biblioteca pd é 2.3.3
A versão da biblioteca np é 2.3.4
A versão da biblioteca sea é 0.13.2
A biblioteca plt não tem modulo de versão
A biblioteca px não tem modulo de versão
A biblioteca go não tem modulo de versão
A biblioteca make_subplots não tem modulo de versão
A biblioteca ff não tem modulo de versão

In [20]:
df = pd.read_excel("./excel/Analise_Performance_Estudantes.xlsx")
print("Mostrando as primeiras 5 linhas")
display(df.head(5))


print('-' * 30)

print("mostrando as ultimas 5 linhas")

display(df.tail(5))

print('-' * 30)

print("mostrando as informações") 

display(df.info())

Mostrando as primeiras 5 linhas

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

------------------------------
mostrando as ultimas 5 linhas

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
4995,male,group D,some high school,free/reduced,none,67,67,55
4996,female,group B,some high school,free/reduced,none,67,61,56
4997,female,group C,associate's degree,free/reduced,completed,51,63,55
4998,male,group E,bachelor's degree,standard,none,60,46,55
4999,female,group C,bachelor's degree,free/reduced,none,78,82,87

------------------------------
mostrando as informações
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       5000 non-null   object
 1   race/ethnicity               5000 non-null   object
 2   parental level of education  5000 non-null   object
 3   lunch                        5000 non-null   object
 4   test preparation course      5000 non-null   object
 5   math score                   5000 non-null   int64
 6   reading score                5000 non-null   int64
 7   writing score                5000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 312.6+ KB

None

# renomear colunas

In [21]:
#vendo as colunas
display(df.head())

#renomeando

df = df.rename(columns=({
    "gender": "genero",
    "race/ethnicity":"raca/etinia",
    "parental level of education": "nivel_escolaridade_dos_pais",
    "lunch":"almoco",
    "test preparation course":"curso_preparatorio_para_test",
    "math score":"nota_matematica",
    "reading score":"nota_leitura",
    "writing score":"nota_escrita"
    }))

display(df.head())

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

,genero,raca/etinia,nivel_escolaridade_dos_pais,almoco,curso_preparatorio_para_test,nota_matematica,nota_leitura,nota_escrita
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [22]:
display(df.head())
df = df.replace({"male":"masculino", "female": "feminino"})
display(df.head(3))

,genero,raca/etinia,nivel_escolaridade_dos_pais,almoco,curso_preparatorio_para_test,nota_matematica,nota_leitura,nota_escrita
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

,genero,raca/etinia,nivel_escolaridade_dos_pais,almoco,curso_preparatorio_para_test,nota_matematica,nota_leitura,nota_escrita
0,feminino,group B,bachelor's degree,standard,none,72,72,74
1,feminino,group C,some college,standard,completed,69,90,88
2,feminino,group B,master's degree,standard,none,90,95,93

# filtrar valores unicos

In [23]:
for column in df.columns:
    print(f"Valores unicos na coluna {column}")
    if df[column].dtype == "object":
        print(df[column].unique())
    else:
        print(df[column].nunique())
    print('-' * 50)

Valores unicos na coluna genero
['feminino' 'masculino']
--------------------------------------------------
Valores unicos na coluna raca/etinia
['group B' 'group C' 'group A' 'group D' 'group E']
--------------------------------------------------
Valores unicos na coluna nivel_escolaridade_dos_pais
["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']
--------------------------------------------------
Valores unicos na coluna almoco
['standard' 'free/reduced']
--------------------------------------------------
Valores unicos na coluna curso_preparatorio_para_test
['none' 'completed']
--------------------------------------------------
Valores unicos na coluna nota_matematica
87
--------------------------------------------------
Valores unicos na coluna nota_leitura
82
--------------------------------------------------
Valores unicos na coluna nota_escrita
86
--------------------------------------------------

# Salvando a nova base com modificações

In [25]:
nomeNovo = "./excel/novo_excel_modificado.xlsx"

if df.to_excel(nomeNovo, index=False) == True:
    print(f"Arquivo salvo na pasta excel com o nome de {nomeNovo}")
else:
    print("O arquivo já existe no destino 'excel'")

O arquivo já existe no destino 'excel'

#criar grafico